Revit 2027 API
PrintParameters.PaperSource Property
 The page source.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PaperSource PaperSource { get; set; }
Public Property PaperSource As PaperSource
	Get
	Set
public:
property PaperSource^ PaperSource {
	PaperSource^ get ();
	void set (PaperSource^ value);
}
member PaperSource : PaperSource with get, set
Property Value
PaperSource
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument is null.
ArgumentException |  Thrown when the input argument is invalid for current printer.
Remarks
User can select the candidate via PaperSources and then set the Page source of the Print Setting.
See Also
Reference
PrintParameters Class
Autodesk.Revit.DB Namespace